Repository: Unixcision/uniconnect
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.omc.usage
source: Usage: cmux omc [omc-args...] Launch Oh My Claude Code (OMC) with native UniConnect pane integration. OMC is a multi-agent orchestration system for Claude Code with specialized agents, smart model routing, and team pipelines. This command sets up a tmux shim so OMC team mode and agent panes become native UniConnect splits. This command: - sets a tmux-like environment so OMC uses UniConnect splits - prepends a private tmux shim to PATH - injects NODE_OPTIONS restore module for Claude compatibility - forwards all remaining arguments to omc Install: npm install -g oh-my-claude-sisyphus Examples: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
ar: الاستخدام: cmux omc [omc-args...] إطلاق Oh My Claude Code (OMC) مع تكامل جزء UniConnect الأصلي. OMC هو نظام تنسيق متعدد الوكلاء لـ Claude Code مع وكلاء متخصصين، وتوجيه النماذج الذكية، وخطوط أنابيب الفريق. يقوم هذا الأمر بإعداد tmux الرقائق بحيث OMC يصبح وضع الفريق وأجزاء الوكيل أصلية UniConnect. هذا الأمر: - يضبط بيئة تشبه tmux، لذا يستخدم OMC تقسيمات UniConnect - يُلحق tmux الخاص بـ PATH - يحقن وحدة الاستعادة NODE_OPTIONS للتوافق Claude - يعيد توجيه كافة الوسائط المتبقية إلى omc ثَبَّتَ: npm install -g oh-my-claude-sisyphus أمثلة: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
bs: Upotreba: cmux omc [omc-args...] Pokrenite Oh My Claude Code (OMC) s izvornom UniConnect integracijom okna. OMC je sistem orkestracije sa više agenata za Claude Code sa specijalizovanim agentima, pametnim modelom rutiranja i timskim kanalima. Ova naredba postavlja tmux shim tako da OMC timski način i paneli agenta postaju izvorni UniConnect podijeljeni. Ova komanda: - postavlja okruženje slično tmux tako da OMC koristi UniConnect podjele - dodaje privatni tmux shim na PATH - ubacuje NODE_OPTIONS modul za vraćanje za Claude kompatibilnost - prosljeđuje sve preostale argumente na omc Instaliraj: npm install -g oh-my-claude-sisyphus Primjeri: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
da: Brug: cmux omc [omc-args...] Start Oh My Claude Code (OMC) med indbygget UniConnect rudeintegration. OMC er et multi-agent orkestreringssystem til Claude Code med specialiserede agenter, smart model routing og team pipelines. Denne kommando sætter et tmux shim op, så OMC teamtilstand og agentruder bliver native UniConnect opdelinger. Denne kommando: - indstiller et tmux-lignende miljø, så OMC bruger UniConnect splits - sætter et privat tmux shim foran PATH - indsætter NODE_OPTIONS gendannelsesmodul for Claude kompatibilitet - videresender alle resterende argumenter til omc Installere: npm install -g oh-my-claude-sisyphus Eksempler: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
de: Verwendung: cmux omc [omc-args...] Starten Sie Oh My Claude Code (OMC) mit nativer UniConnect-Bereichsintegration. OMC ist ein Multiagenten-Orchestrierungssystem für Claude Code mit spezialisierten Agenten, intelligentem Modellrouting und Team-Pipelines. Dieser Befehl richtet einen tmux-Shim ein, sodass der OMC-Teammodus und die Agentenbereiche zu nativen UniConnect-Teilungen werden. Dieser Befehl: - legt eine tmux-ähnliche Umgebung fest, sodass OMC UniConnect-Aufteilungen verwendet - stellt PATH einen privaten tmux-Shim voran - fügt das NODE_OPTIONS-Wiederherstellungsmodul für Claude-Kompatibilität ein - leitet alle verbleibenden Argumente an omc weiter Installieren: npm install -g oh-my-claude-sisyphus Beispiele: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
es: Uso: cmux omc [omc-args...] Inicia Oh My Claude Code (OMC) con integración nativa de paneles en UniConnect. OMC es un sistema de coordinación multiagente para Claude Code con agentes especializados, selección inteligente de modelos y flujos de trabajo en equipo. Este comando prepara un shim de tmux para convertir el modo equipo y los paneles de agentes de OMC en divisiones nativas de UniConnect. Este comando: - configura un entorno compatible con tmux para que OMC use divisiones de UniConnect - antepone a PATH un shim privado de tmux - inyecta mediante NODE_OPTIONS el módulo de restauración para Claude - reenvía a omc todos los argumentos restantes Instalación: npm install -g oh-my-claude-sisyphus Ejemplos: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
fr: Usage: cmux omc [omc-args...] Lancez Oh My Claude Code (OMC) avec l'intégration native du volet UniConnect. OMC est un système d'orchestration multi-agents pour Claude Code avec des agents spécialisés, un routage de modèles intelligent et des pipelines d'équipe. Cette commande configure une cale tmux afin que le mode équipe OMC et les volets d'agent deviennent des divisions natives UniConnect. Cette commande: - définit un environnement de type tmux afin que OMC utilise les fractionnements UniConnect - ajoute une cale tmux privée à PATH - injecte le module de restauration NODE_OPTIONS pour la compatibilité Claude - transmet tous les arguments restants à omc Installer: npm install -g oh-my-claude-sisyphus Exemples: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
it: Utilizzo: cmux omc [omc-args...] Avvia Oh My Claude Code (OMC) con l'integrazione nativa del riquadro UniConnect. OMC è un sistema di orchestrazione multi-agente per Claude Code con agenti specializzati, routing del modello intelligente e pipeline dei team. Questo comando configura uno shim tmux in modo che la modalità team OMC e i riquadri agente diventino suddivisi UniConnect nativi. Questo comando: - imposta un ambiente simile a tmux quindi OMC utilizza UniConnect si divide - antepone uno shim tmux privato a PATH - inserisce il modulo di ripristino NODE_OPTIONS per la compatibilità Claude - inoltra tutti gli argomenti rimanenti a omc Installare: npm install -g oh-my-claude-sisyphus Esempi: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
ja: 使用法: cmux omc [omc-args...] ネイティブ UniConnect ペイン統合を使用して Oh My Claude Code (OMC) を起動します。 OMC は、特殊なエージェント、スマート モデル ルーティング、チーム パイプラインを備えた Claude Code 用のマルチエージェント オーケストレーション システムです。このコマンドは tmux シムをセットアップするため、OMC チーム モードとエージェント ペインはネイティブの UniConnect 分割になります。 このコマンドは: - tmux のような環境を設定して、OMC が UniConnect 分割を使用するようにします。 - プライベート tmux shim を PATH の先頭に追加します - Claude の互換性のために NODE_OPTIONS 復元モジュールを挿入します - 残りの引数をすべて omc に転送します インストール: npm install -g oh-my-claude-sisyphus 例: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
km: ការប្រើប្រាស់: cmux omc [omc-args...] បើកដំណើរការ Oh My Claude Code (OMC) ជាមួយនឹងការរួមបញ្ចូលផ្ទាំងដើម UniConnect ។ OMC គឺជាប្រព័ន្ធពហុភ្នាក់ងារសម្រាប់ Claude Code ជាមួយនឹងភ្នាក់ងារឯកទេស ការកំណត់ផ្លូវគំរូឆ្លាតវៃ និងបំពង់ក្រុម។ ពាក្យបញ្ជានេះបង្កើត tmux shim ដូច្នេះ OMC របៀបក្រុម ហើយផ្ទាំងភ្នាក់ងារក្លាយជាដើម UniConnect បំបែក។ ពាក្យបញ្ជានេះ។: - កំណត់បរិយាកាសដូច tmux ដូច្នេះ OMC ប្រើការបំបែក UniConnect - បន្ថែម tmux ឯកជនទៅ PATH - ចាក់ NODE_OPTIONS ស្តារម៉ូឌុលសម្រាប់ Claude ភាពឆបគ្នា - បញ្ជូនបន្តអាគុយម៉ង់ដែលនៅសល់ទាំងអស់ទៅ omc ដំឡើង: npm install -g oh-my-claude-sisyphus ឧទាហរណ៍: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
ko: 용법: cmux omc [omc-args...] 기본 UniConnect 창 통합을 사용하여 Oh My Claude Code(OMC)을 시작합니다. OMC은 전문 에이전트, 스마트 모델 라우팅 및 팀 파이프라인을 갖춘 Claude Code을 위한 다중 에이전트 오케스트레이션 시스템입니다. 이 명령은 tmux shim을 설정하므로 OMC 팀 모드와 에이전트 창이 기본 UniConnect 분할이 됩니다. 이 명령: - tmux과 유사한 환경을 설정하므로 OMC는 UniConnect 분할을 사용합니다. - 비공개 tmux 심을 PATH 앞에 추가합니다. - Claude 호환성을 위해 NODE_OPTIONS 복원 모듈을 삽입합니다. - 나머지 모든 인수를 omc으로 전달합니다. 설치하다: npm install -g oh-my-claude-sisyphus 예: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
nb: Bruk: cmux omc [omc-args...] Start Oh My Claude Code (OMC) med innebygd UniConnect ruteintegrasjon. OMC er et multi-agent orkestreringssystem for Claude Code med spesialiserte agenter, smart modellruting og teampipelines. Denne kommandoen setter opp en tmux shim slik at OMC teammodus og agentruter blir native UniConnect splitter. Denne kommandoen: - setter et tmux-lignende miljø slik at OMC bruker UniConnect splitter - legger et privat tmux mellomlegg til PATH - injiserer NODE_OPTIONS gjenopprettingsmodul for Claude kompatibilitet - videresender alle gjenværende argumenter til omc Installer: npm install -g oh-my-claude-sisyphus Eksempler: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
pl: Stosowanie: cmux omc [omc-args...] Uruchom Oh My Claude Code (OMC) z natywną integracją panelu UniConnect. OMC to wieloagentowy system orkiestracji dla Claude Code z wyspecjalizowanymi agentami, inteligentnym routingiem modeli i potokami zespołowymi. To polecenie konfiguruje podkładkę tmux, dzięki czemu OMC tryb zespołowy i okienka agentów stają się natywnymi podziałami UniConnect. To polecenie: - ustawia środowisko podobne do tmux, więc OMC używa podziałów UniConnect - dołącza prywatną podkładkę tmux do PATH - wstrzykuje moduł przywracania NODE_OPTIONS w celu zapewnienia zgodności z Claude - przekazuje wszystkie pozostałe argumenty do omc Zainstalować: npm install -g oh-my-claude-sisyphus Przykłady: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
pt_br: Uso: cmux omc [omc-args...] Inicie Oh My Claude Code (OMC) com integração de painel UniConnect nativo. OMC é um sistema de orquestração multiagente para Claude Code com agentes especializados, roteamento de modelo inteligente e pipelines de equipe. Este comando configura um shim tmux para que o modo de equipe OMC e os painéis do agente se tornem divisões UniConnect nativas. Este comando: - define um ambiente semelhante a tmux para que OMC use divisões UniConnect - acrescenta um shim tmux privado para PATH - injeta módulo de restauração NODE_OPTIONS para compatibilidade Claude - encaminha todos os argumentos restantes para omc Instalar: npm install -g oh-my-claude-sisyphus Exemplos: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
ru: Использование: cmux omc [omc-args...] Запустите Oh My Claude Code (OMC) с встроенной интеграцией панели UniConnect. OMC — это многоагентная система оркестровки для Claude Code со специализированными агентами, маршрутизацией интеллектуальной модели и командными конвейерами. Эта команда устанавливает прокладку tmux, поэтому групповой режим OMC и панели агентов становятся родными UniConnect. Эта команда: - устанавливает среду, подобную tmux, поэтому OMC использует разделения UniConnect - добавляет частную прокладку tmux к PATH - вставляет модуль восстановления NODE_OPTIONS для совместимости с Claude - пересылает все оставшиеся аргументы на omc Установить: npm install -g oh-my-claude-sisyphus Примеры: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
th: การใช้งาน: cmux omc [omc-args...] เปิดตัว Oh My Claude Code (OMC) ด้วยการรวมบานหน้าต่าง UniConnect ดั้งเดิม OMC คือระบบการจัดการหลายตัวแทนสำหรับ Claude Code พร้อมด้วยตัวแทนเฉพาะทาง การกำหนดเส้นทางโมเดลอัจฉริยะ และไปป์ไลน์ของทีม คำสั่งนี้ตั้งค่า tmux shim เพื่อให้โหมดทีม OMC และบานหน้าต่างตัวแทนกลายเป็น UniConnect แบบเนทิฟ คำสั่งนี้: - ตั้งค่าสภาพแวดล้อมที่เหมือน tmux ดังนั้น OMC ใช้ UniConnect แยก - เพิ่ม tmux shim ส่วนตัวเป็น PATH - ฉีด NODE_OPTIONS เรียกคืนโมดูลสำหรับความเข้ากันได้ Claude - ส่งต่ออาร์กิวเมนต์ที่เหลือทั้งหมดไปที่omc ติดตั้ง: npm install -g oh-my-claude-sisyphus ตัวอย่าง: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
tr: Kullanım: cmux omc [omc-args...] Yerel UniConnect bölme entegrasyonuyla Oh My Claude Code'i (OMC) başlatın. OMC, Claude Code için özel aracılar, akıllı model yönlendirme ve ekip işlem hatları içeren çok aracılı bir orkestrasyon sistemidir. Bu komut bir tmux dolgusu ayarlar, böylece OMC ekip modu ve aracı bölmeleri yerel UniConnect bölmeleri haline gelir. Bu komut: - tmux benzeri bir ortam ayarlar, böylece OMC, UniConnect bölmelerini kullanır - PATH'in başına özel bir tmux dolgusu ekler - Claude uyumluluğu için NODE_OPTIONS geri yükleme modülünü enjekte eder - kalan tüm bağımsız değişkenleri omc adresine iletir Düzenlemek: npm install -g oh-my-claude-sisyphus Örnekler: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
uk: Використання: cmux omc [omc-args...] Запустіть Oh My Claude Code (OMC) із вбудованою інтеграцією панелі UniConnect. OMC — це багатоагентна система оркестровки для Claude Code зі спеціалізованими агентами, розумною моделлю маршрутизації та командними конвеєрами. Ця команда встановлює tmux прокладку, щоб OMC командний режим і панелі агента стали рідними UniConnect розділеннями. Ця команда: - встановлює tmux-подібне середовище, тому OMC використовує UniConnect розділення - додає приватну прокладку tmux до PATH - вводить NODE_OPTIONS модуль відновлення для Claude сумісності - пересилає всі решта аргументів на omc встановити: npm install -g oh-my-claude-sisyphus Приклади: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
zh_hans: 用法: cmux omc [omc-args...] 通过本机 UniConnect 窗格集成启动 Oh My Claude Code (OMC)。 OMC 是 Claude Code 的多代理编排系统，具有专门的代理、智能模型路由和团队管道。此命令设置 tmux shim，以便 OMC 团队模式和代理窗格成为本机 UniConnect 拆分。 这个命令: - 设置类似 tmux 的环境，因此 OMC 使用 UniConnect 分割 - 将私有 tmux 填充程序添加到 PATH - 注入 NODE_OPTIONS 恢复模块以实现 Claude 兼容性 - 将所有剩余参数转发到 omc 安装: npm install -g oh-my-claude-sisyphus 示例: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
zh_hant: 用法: cmux omc [omc-args...] 透過本機 UniConnect 窗格整合啟動 Oh My Claude Code (OMC)。 OMC 是 Claude Code 的多代理編排系統，具有專門的代理、智慧模型路由和團隊管道。此指令設定 tmux shim，以便 OMC 團隊模式和代理程式窗格成為本機 UniConnect 分割。 這個命令: - 設定類似 tmux 的環境，因此 OMC 使用 UniConnect 分割 - 將私有 tmux 填滿程式加入 PATH - 注入 NODE_OPTIONS 恢復模組以實現 Claude 相容性 - 將所有剩餘參數轉送到 omc 安裝: npm install -g oh-my-claude-sisyphus 範例: cmux omc cmux omc team 3:claude "implement feature" cmux omc --watch
